# DataFrame:
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
Data frame is a class of pandas module

#### Features of DataFrame
        Potentially columns are of different types (some columns are of integer while some are of string)
        Size – Mutable (We are able to do inplace changes in dataframe)
        Labeled axes (rows and columns)
        Can Perform Arithmetic operations on rows and columns

##### pandas.DataFrame

A pandas DataFrame can be created using the following constructs −

pandas.DataFrame( data, index, columns, dtype, copy)

pandas.DataFrame(data,row,column,dtype)

##### Create DataFrame
    A pandas DataFrame can be created using various inputs like − Data can be provided as

      #  Lists
      #  dict
      #  Series
      #  Numpy ndarrays
      #  Another DataFrame

##### Import pandas module

In [1]:
import numpy as np
import pandas as pd

##### Create empty dataframe

In [2]:
print(pd.DataFrame())         # Data, index(row), column, dtype

Empty DataFrame
Columns: []
Index: []

In [3]:
s=pd.Series([10,20,30,40])   # Default positional argument is data 
s

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
d = pd.DataFrame([10,20,30,40])    # Creation of 2D dataframe with single column and 4 rows
d

    0
0  10
1  20
2  30
3  40

structure of series is 1D while dataframe is 2D. names are associated with columns

In [5]:
# Creation of 2D dataframe using numpy

import numpy as np
d = pd.DataFrame(np.arange(16).reshape(4,4))
d

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
# creation of data frame with customized indexes and column names 
d = pd.DataFrame(np.arange(16).reshape(4,4),index=[1,2,3,4],columns=['a','b','c','d'])
d

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [7]:
# Here each inner list is one row
d = pd.DataFrame([[1,'a'],[2,'b'],[3,'c']],index=[1,2,3],columns=['id','name'])
d

   id name
1   1    a
2   2    b
3   3    c

In [8]:
# Dataframe creation using dictionary data
# Here key of dictionary act as name of column and values associated with it act as rows of that column

d=pd.DataFrame({'name':['Abhi','amol','ajay','atul'],'age':[25,23,30,35]},index=[10,20,30,40])
d

    name  age
10  Abhi   25
20  amol   23
30  ajay   30
40  atul   35

In [9]:
# Values are associated with name and age. so NaN comes under city and score.

d = pd.DataFrame({'name':['abhi','amol','ajay','atul'],'age':[25,23,30,35]},index=[10,20,30,40],columns=['city','score'])
d

   city score
10  NaN   NaN
20  NaN   NaN
30  NaN   NaN
40  NaN   NaN

In [10]:
# For accessing values of any column   
# Number of values in each column and number of index values should match exactly

d = pd.DataFrame({'name':['abhi','amol','ajay','atul'],'age':[25,23,30,35]},index=[10,20,30,40])
d['name']

10    abhi
20    amol
30    ajay
40    atul
Name: name, dtype: object

In [11]:
# Still if i want to change name of column

d.rename(columns={'name':'city'},inplace=True)   # To perform inplace changes we need to set inplace to true
d

    city  age
10  abhi   25
20  amol   23
30  ajay   30
40  atul   35

In [12]:
# in list of list structure first list as first row and second list as second row
# If any of the value missing in nested list then it is replaced ny None.
# It cant affect remaining values of that column
            
d = pd.DataFrame([['Amol','Ajay','Atul','Abhi'], [25,23,28]],index=['Name','Age'],columns=list('abcd'))
d

         a     b     c     d
Name  Amol  Ajay  Atul  Abhi
Age     25    23    28  None

In [13]:
# If we want transpose of data frame then

d.T

   Name   Age
a  Amol    25
b  Ajay    23
c  Atul    28
d  Abhi  None

In [14]:
# DataFrame by passing list of dictionaries
#Note- If any value is missing in dictonary then it is replaced by NaN(not a number)
     # It will convert all values of that column only to floating point
     # Key act as column ame and values of one dict as one row
    
d = pd.DataFrame([{'a':10,'b':20,'c':30},{'a':100,'b':200}])
d

     a    b     c
0   10   20  30.0
1  100  200   NaN

In [15]:
# If we dont want a column having NaN value then don't specify that column

d = pd.DataFrame([{'a':10,'b':20,'c':30},{'a':100,'b':200}],index=['First','Second'],columns=['a','b']) 
d

          a    b
First    10   20
Second  100  200

##### Default data types of numpy, Series and DataFrame

In [16]:
# Datatype of numpy is float64

import numpy as np             
np.array([])

array([], dtype=float64)

In [17]:
# Datatype of series is float64 but it is deprecated so specify it explicitly

pd.Series([])

<ipython-input-17-074779b40804>:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series([])

Series([], dtype: float64)

In [18]:
pd.DataFrame().dtypes           # Datatype of DataFrame is object

Series([], dtype: object)

##### DataFrame creation by using dictionary of series

In [19]:
d = pd.DataFrame({'one':pd.Series([1,2,3,4,5]),'two':pd.Series([10,20,30,40,50])})
d

   one  two
0    1   10
1    2   20
2    3   30
3    4   40
4    5   50

In [20]:
# DataFrame creation using series only

d=pd.DataFrame(pd.Series([1,2,3,4]),columns=['No'])
d

   No
0   1
1   2
2   3
3   4

In [21]:
data = [pd.Series([1,2,3]),pd.Series([10,20,30])]
d=pd.DataFrame(data)
d

    0   1   2
0   1   2   3
1  10  20  30

In [22]:
# DataFrame creation using 1D array

import numpy as np
a = np.arange(2,26).reshape(4,6)
a

array([[ 2,  3,  4,  5,  6,  7],
       [ 8,  9, 10, 11, 12, 13],
       [14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25]])

In [23]:
d = pd.DataFrame(a)
d

    0   1   2   3   4   5
0   2   3   4   5   6   7
1   8   9  10  11  12  13
2  14  15  16  17  18  19
3  20  21  22  23  24  25

In [24]:
d = pd.DataFrame(a,columns=['a','b','c','d','e','f'])
d

    a   b   c   d   e   f
0   2   3   4   5   6   7
1   8   9  10  11  12  13
2  14  15  16  17  18  19
3  20  21  22  23  24  25

##### Get total number of items in DataFrame

In [25]:
d.size

24

##### Get dimensionality of DataFrame

In [26]:
d.ndim

2

##### Get structure of DataFrame

In [27]:
d.shape

(4, 6)

##### Get values of DataFrame

In [28]:
d.values

array([[ 2,  3,  4,  5,  6,  7],
       [ 8,  9, 10, 11, 12, 13],
       [14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25]])

##### Check whether DataFrame is empty

In [29]:
d.empty

False

##### Get items of DataFrame

In [30]:
# It returns object

d.items

<bound method DataFrame.items of     a   b   c   d   e   f
0   2   3   4   5   6   7
1   8   9  10  11  12  13
2  14  15  16  17  18  19
3  20  21  22  23  24  25>

##### Get range of index

In [31]:
d.index

RangeIndex(start=0, stop=4, step=1)

##### Get index names of DataFrame

In [32]:
for i in d.index:     
    print(i)

0
1
2
3

##### Get first five records of DataFrame

In [33]:
d.head()

    a   b   c   d   e   f
0   2   3   4   5   6   7
1   8   9  10  11  12  13
2  14  15  16  17  18  19
3  20  21  22  23  24  25

In [34]:
# Return first two records

d.head(2)

   a  b   c   d   e   f
0  2  3   4   5   6   7
1  8  9  10  11  12  13

##### Get last five records of DataFrame

In [35]:
d.tail()

    a   b   c   d   e   f
0   2   3   4   5   6   7
1   8   9  10  11  12  13
2  14  15  16  17  18  19
3  20  21  22  23  24  25

In [36]:
# Return last two records

d.tail(2)

    a   b   c   d   e   f
2  14  15  16  17  18  19
3  20  21  22  23  24  25

##### Get descriptive analysis of DataFrame
It will gives column wise analysis of data

In [37]:
d.describe()

               a          b          c          d          e          f
count   4.000000   4.000000   4.000000   4.000000   4.000000   4.000000
mean   11.000000  12.000000  13.000000  14.000000  15.000000  16.000000
std     7.745967   7.745967   7.745967   7.745967   7.745967   7.745967
min     2.000000   3.000000   4.000000   5.000000   6.000000   7.000000
25%     6.500000   7.500000   8.500000   9.500000  10.500000  11.500000
50%    11.000000  12.000000  13.000000  14.000000  15.000000  16.000000
75%    15.500000  16.500000  17.500000  18.500000  19.500000  20.500000
max    20.000000  21.000000  22.000000  23.000000  24.000000  25.000000

In [38]:
# Get required percentiles percentile

d.describe(percentiles=[.60])

               a          b          c          d          e          f
count   4.000000   4.000000   4.000000   4.000000   4.000000   4.000000
mean   11.000000  12.000000  13.000000  14.000000  15.000000  16.000000
std     7.745967   7.745967   7.745967   7.745967   7.745967   7.745967
min     2.000000   3.000000   4.000000   5.000000   6.000000   7.000000
50%    11.000000  12.000000  13.000000  14.000000  15.000000  16.000000
60%    12.800000  13.800000  14.800000  15.800000  16.800000  17.800000
max    20.000000  21.000000  22.000000  23.000000  24.000000  25.000000

In [39]:
# Get one of the parameter from describe

d.min()

a    2
b    3
c    4
d    5
e    6
f    7
dtype: int32

##### Get consize summary of DataFrame
It returns how many non-null rows, columns, data type, memory usage

In [40]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      int32
 1   b       4 non-null      int32
 2   c       4 non-null      int32
 3   d       4 non-null      int32
 4   e       4 non-null      int32
 5   f       4 non-null      int32
dtypes: int32(6)
memory usage: 224.0 bytes

##### Create DataFrame using list of dictionaries
If having some missing values they are replaced by NaN

In [41]:
d = pd.DataFrame([{'a':2,'b':4},{'c':5}])
d

     a    b    c
0  2.0  4.0  NaN
1  NaN  NaN  5.0

##### Get consize summary of DataFrame

In [42]:
# Each column has one NaN value

d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       1 non-null      float64
 1   b       1 non-null      float64
 2   c       1 non-null      float64
dtypes: float64(3)
memory usage: 176.0 bytes

##### check for missing values/NaN present in specific column as boolean output

In [43]:
d.isnull()

       a      b      c
0  False  False   True
1   True   True  False

##### Get count of missing values in each column
It indicates that each column contains one missing value

In [44]:
d.isnull().sum()

a    1
b    1
c    1
dtype: int64

In [45]:
d.isna().sum()

a    1
b    1
c    1
dtype: int64

### Selection, Addition and Deletion of rows

##### Create DataFrame

In [46]:
data = np.arange(2,26).reshape(6,4)
d = pd.DataFrame(data, columns=['a','b','c','d'])
d

    a   b   c   d
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

##### Slicing works on rows
columns does not support negative sclicing      
[:] #rows    
[:,:] #rows,columns     
[::,::]

In [47]:
# To access first two rows

d[:2]

   a  b  c  d
0  2  3  4  5
1  6  7  8  9

##### Get list of columns 
Column may containg pre / post spaces so to avoid errors  check names first

In [48]:
d.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

##### Rename names of columns
It is to remove pre / post spaces and to change case of string (upper/lower/title)

In [49]:
d.rename(columns={'a':' a'},inplace=True)
d

    a   b   c   d
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [50]:
 # We need to check column names as it can be 'a',' a','a ',' a '

d.columns

Index([' a', 'b', 'c', 'd'], dtype='object')

In [51]:
# Way to access single column

d[' a']

0     2
1     6
2    10
3    14
4    18
5    22
Name:  a, dtype: int32

In [52]:
# It can be possible like

d.b

0     3
1     7
2    11
3    15
4    19
5    23
Name: b, dtype: int32

##### Access multiple columns of DataFrame

In [53]:
# To acess multiple columns we need to provide them in nested list

d[[' a','b']]

    a   b
0   2   3
1   6   7
2  10  11
3  14  15
4  18  19
5  22  23

Note-
If we acess single column it generate series
If we access multiple columns it generates dataframe. To access multiple columns we need to provide list inside list

##### Access specific entries of DataFrame

In [54]:
# Access first two entries of column a and b

d[[' a','b']][:2]

    a  b
0   2  3
1   6  7

##### Information about any column as series

In [55]:
d['b'],type(d['b']), d['b'].ndim

(0     3
 1     7
 2    11
 3    15
 4    19
 5    23
 Name: b, dtype: int32,
 pandas.core.series.Series,
 1)

##### Information about any column as DataFrame

In [56]:
d[['b']],type(d[['b']]),d[['b']].ndim

(    b
 0   3
 1   7
 2  11
 3  15
 4  19
 5  23,
 pandas.core.frame.DataFrame,
 2)

Ways to select single column we have 3 options
   -df.A=>Series=>1 dim   
   -df['A']=>Series=>1 dim   
   -df[['A']]=>Df=>2 dim

##### To access rows and column through labels [row,column]

In [57]:
# [all row,all column]

d.loc[:,:]

    a   b   c   d
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
4  18  19  20  21
5  22  23  24  25

In [58]:
# Access records at index 2 and 4 of  b and c columns without using slicing

d.loc[2::2,['b','c']]

    b   c
2  11  12
4  19  20

In [59]:
# Access records at index 2 and 4 of  b and c columns using slicing

d.loc[2::2,'b':'d':2]

    b   d
2  11  13
4  19  21

In [60]:
# Access all records of column b only

d.loc[:,'b':'b']

    b
0   3
1   7
2  11
3  15
4  19
5  23

In [61]:
d.loc[:,'b']      # To access column b only for all rows as Series i.e. without name of column

0     3
1     7
2    11
3    15
4    19
5    23
Name: b, dtype: int32

In [62]:
# Access elements at random index 1,2,3,5

d.loc[[1,2,3,5]]

    a   b   c   d
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17
5  22  23  24  25

In [63]:
# Access rows at index 0,1,5 at columns b and d
                
d.loc[[0,1,5],['b','d']]

    b   d
0   3   5
1   7   9
5  23  25

In [64]:
# In case of loc endpoint is exclusive
                # In case of iloc endpoints are inclusive                  
                # In case of iloc index and columns are refered as index at the back end. No need of specifying column name   
# Access first two records for a and b column

d.iloc[:2,:2]

    a  b
0   2  3
1   6  7

In [65]:
# Access first two records for all columns in reverse order

d.iloc[:2,::-1]

   d  c  b   a
0  5  4  3   2
1  9  8  7   6

In [66]:
# Access records at index 1,3, and 5 of columns at index 0,2,3 (a,c,d)

d.iloc[1::2,[0,2,3]]

    a   c   d
1   6   8   9
3  14  16  17
5  22  24  25

In [67]:
# Access all records of columns at index 0,1,3 (a,b,d)

d.iloc[:,[0,1,3]]

    a   b   d
0   2   3   5
1   6   7   9
2  10  11  13
3  14  15  17
4  18  19  21
5  22  23  25

In [68]:
# Slicing cant work on columns. it will return last column as output

d.iloc[:,4:2:-1]

    d
0   5
1   9
2  13
3  17
4  21
5  25

##### Combining records of multiple dataFrames

In [69]:
# Using append: Indexing is not streamline, it may repreat or descrite

data1=[('Amar',28,'Baramati','India'),
     ('Ajay',28,'New york','US')]
df1 = pd.DataFrame(data1,index=[1,2],columns=['Name','Age','City','Country'])


data2=[('Atul',24,'Sydeny','Austrellia'),
      ('Jagdish',26,'Pune','India')]
df2 = pd.DataFrame(data2,index=[1,2],columns=['Name','Age','City','Country'])

df1.append(df2)

      Name  Age      City     Country
1     Amar   28  Baramati       India
2     Ajay   28  New york          US
1     Atul   24    Sydeny  Austrellia
2  Jagdish   26      Pune       India

In [70]:
# To streamline indexing set ignore_index=True

df1.append(df2,ignore_index=True)

      Name  Age      City     Country
0     Amar   28  Baramati       India
1     Ajay   28  New york          US
2     Atul   24    Sydeny  Austrellia
3  Jagdish   26      Pune       India

In [71]:
# Insert NaN For missing values

df1.append({'Name':'Sumit','Country':'Japan'},ignore_index=True)

    Name   Age      City Country
0   Amar  28.0  Baramati   India
1   Ajay  28.0  New york      US
2  Sumit   NaN       NaN   Japan

In [72]:
# Create new column name, as python is case sensitive it put NaN for remaining rows

df1.append({'name':'Sumit','Country':'Japan'},ignore_index=True)

   Name   Age      City Country   name
0  Amar  28.0  Baramati   India    NaN
1  Ajay  28.0  New york      US    NaN
2   NaN   NaN       NaN   Japan  Sumit

##### Append Series and DataFrame

In [73]:
s=pd.Series(['Sahil',20,'Mumbai','India'],index=['Name','Age','City','Country'])
s

Name        Sahil
Age            20
City       Mumbai
Country     India
dtype: object

In [74]:
df1.append(s,ignore_index=True)

    Name  Age      City Country
0   Amar   28  Baramati   India
1   Ajay   28  New york      US
2  Sahil   20    Mumbai   India

In [75]:
s1=pd.Series(['Sanjay',26,'Kolkatta','India'])
s1

0      Sanjay
1          26
2    Kolkatta
3       India
dtype: object

In [76]:
# It will create new columns with index 0,1,2,3 

df1.append(s1,ignore_index=True)

   Name   Age      City Country       0     1         2      3
0  Amar  28.0  Baramati   India     NaN   NaN       NaN    NaN
1  Ajay  28.0  New york      US     NaN   NaN       NaN    NaN
2   NaN   NaN       NaN     NaN  Sanjay  26.0  Kolkatta  India

In [77]:
# Get names of DataFrame columns

df1.columns

Index(['Name', 'Age', 'City', 'Country'], dtype='object')

In [78]:
# Instead of specifying index explicitely we can specify it by df.columns

s=pd.Series(['Sahil',20,'Mumbai','India'],index=df1.columns)
s

Name        Sahil
Age            20
City       Mumbai
Country     India
dtype: object

In [79]:
df1.append(s,ignore_index=True)

    Name  Age      City Country
0   Amar   28  Baramati   India
1   Ajay   28  New york      US
2  Sahil   20    Mumbai   India

In [80]:
# Append list of Series to DataFrame

listof_series=[pd.Series(['Samir',20,'Mumbai','India'],index=df1.columns),
               pd.Series(['Sudhir',20,'Mumbai','India'],index=df1.columns),
               pd.Series(['Adhir',20,'Mumbai','India'],index=df1.columns)
              ]

In [81]:
df1.append(listof_series,ignore_index=True)

     Name  Age      City Country
0    Amar   28  Baramati   India
1    Ajay   28  New york      US
2   Samir   20    Mumbai   India
3  Sudhir   20    Mumbai   India
4   Adhir   20    Mumbai   India

In [82]:
# Append few records of one DataFrame to another DataFrame

data=[('Samir',25,'Kolkatta','India'),
      ('Sanjay',27,'Nashik','India')]
df2 = pd.DataFrame(data,index=['a','b'],columns=df1.columns)
df2

     Name  Age      City Country
a   Samir   25  Kolkatta   India
b  Sanjay   27    Nashik   India

In [83]:
df2[1:2]

     Name  Age    City Country
b  Sanjay   27  Nashik   India

In [84]:
df1.append(df2[1:2],ignore_index=True)

     Name  Age      City Country
0    Amar   28  Baramati   India
1    Ajay   28  New york      US
2  Sanjay   27    Nashik   India

In [85]:
# Insert record without append

df1.loc['e']=['Rahul',29,'Banglore','India']

# Here order doesn't mater. It insert whatever provided by user

df1.loc[3]=['Mayur',25,'Sangli','India']


# If Entry already present in Data Frame it will overrite it

df1.iloc[1]=['Suraj',28,'Manali','India']
df1

    Name  Age      City Country
1   Amar   28  Baramati   India
2  Suraj   28    Manali   India
e  Rahul   29  Banglore   India
3  Mayur   25    Sangli   India

In [86]:
import pandas as pd
s1 = pd.Series([5, 6, 7])
s2 = pd.Series([7, 8, 9])
df3=pd.DataFrame([list(s1),list(s2)],columns=['a','b','c'])
df3

   a  b  c
0  5  6  7
1  7  8  9

In [87]:
# Inserting row in sorted dataframe

df3.loc[-1] = [2, 3, 4]  # adding a row
df3.index = df3.index + 1  # shifting index
df3 = df3.sort_index()  # sorting by index
df3

   a  b  c
0  2  3  4
1  5  6  7
2  7  8  9

In [88]:
# Insert column in existing DataFrame

df1['Number']=np.arange(4)
df1

    Name  Age      City Country  Number
1   Amar   28  Baramati   India       0
2  Suraj   28    Manali   India       1
e  Rahul   29  Banglore   India       2
3  Mayur   25    Sangli   India       3

In [89]:
df1['random']=np.random.random(4)
df1

    Name  Age      City Country  Number    random
1   Amar   28  Baramati   India       0  0.968728
2  Suraj   28    Manali   India       1  0.363410
e  Rahul   29  Banglore   India       2  0.529552
3  Mayur   25    Sangli   India       3  0.904214

In [90]:
# Insert column in between the dataFrame

val=[11111,222222,33333,44444]
df1.insert(2,'pin',val)
df1

    Name  Age     pin      City Country  Number    random
1   Amar   28   11111  Baramati   India       0  0.968728
2  Suraj   28  222222    Manali   India       1  0.363410
e  Rahul   29   33333  Banglore   India       2  0.529552
3  Mayur   25   44444    Sangli   India       3  0.904214

##### To Rename column

In [91]:
# Rename existing column name of  DataFrame

df1.rename(columns={'City':'Location'},inplace=True)
df1

    Name  Age     pin  Location Country  Number    random
1   Amar   28   11111  Baramati   India       0  0.968728
2  Suraj   28  222222    Manali   India       1  0.363410
e  Rahul   29   33333  Banglore   India       2  0.529552
3  Mayur   25   44444    Sangli   India       3  0.904214

##### To drop row or column from DataFrame

In [92]:
# Delete row using drop and index =0 
# It generate key error if index not found

df1.drop(1,axis=0)

    Name  Age     pin  Location Country  Number    random
2  Suraj   28  222222    Manali   India       1  0.363410
e  Rahul   29   33333  Banglore   India       2  0.529552
3  Mayur   25   44444    Sangli   India       3  0.904214

In [93]:
# Delete collection of rows

df1.drop(['e',2])                    # Set inplace=True if necessary

    Name  Age    pin  Location Country  Number    random
1   Amar   28  11111  Baramati   India       0  0.968728
3  Mayur   25  44444    Sangli   India       3  0.904214

In [94]:
# Delete column of DataFrame using del keyword

del df1['Number']        # Both del and pop delete specified column and changes are inplace    
df1                      # Del cannot return anything while pop return index and deleted column

    Name  Age     pin  Location Country    random
1   Amar   28   11111  Baramati   India  0.968728
2  Suraj   28  222222    Manali   India  0.363410
e  Rahul   29   33333  Banglore   India  0.529552
3  Mayur   25   44444    Sangli   India  0.904214

In [95]:
# pop return index and deleted column

df1.pop('Country')

1    India
2    India
e    India
3    India
Name: Country, dtype: object

In [96]:
# Another way to drop column b. This deletion is inplace

df1.iloc[0:3,:1]=np.nan
df1

    Name  Age     pin  Location    random
1    NaN   28   11111  Baramati  0.968728
2    NaN   28  222222    Manali  0.363410
e    NaN   29   33333  Banglore  0.529552
3  Mayur   25   44444    Sangli  0.904214

In [97]:
df1

    Name  Age     pin  Location    random
1    NaN   28   11111  Baramati  0.968728
2    NaN   28  222222    Manali  0.363410
e    NaN   29   33333  Banglore  0.529552
3  Mayur   25   44444    Sangli  0.904214

##### Remove records with missing values

In [98]:
df1.dropna()     # It will delete row containing NaN value

    Name  Age    pin Location    random
3  Mayur   25  44444   Sangli  0.904214

In [99]:
df1

    Name  Age     pin  Location    random
1    NaN   28   11111  Baramati  0.968728
2    NaN   28  222222    Manali  0.363410
e    NaN   29   33333  Banglore  0.529552
3  Mayur   25   44444    Sangli  0.904214

In [100]:
# Insert record with existing values

df1.loc[4]=['Mayur',25,44444,'Sangli',0.207228]
df1

    Name  Age     pin  Location    random
1    NaN   28   11111  Baramati  0.968728
2    NaN   28  222222    Manali  0.363410
e    NaN   29   33333  Banglore  0.529552
3  Mayur   25   44444    Sangli  0.904214
4  Mayur   25   44444    Sangli  0.207228

##### Remove last duplicated record by checking all column values

In [101]:
df1

    Name  Age     pin  Location    random
1    NaN   28   11111  Baramati  0.968728
2    NaN   28  222222    Manali  0.363410
e    NaN   29   33333  Banglore  0.529552
3  Mayur   25   44444    Sangli  0.904214
4  Mayur   25   44444    Sangli  0.207228

In [102]:
df1.drop_duplicates()

    Name  Age     pin  Location    random
1    NaN   28   11111  Baramati  0.968728
2    NaN   28  222222    Manali  0.363410
e    NaN   29   33333  Banglore  0.529552
3  Mayur   25   44444    Sangli  0.904214
4  Mayur   25   44444    Sangli  0.207228

##### Statistical analysis of data

In [103]:
data={'Name':pd.Series(['Anju','Rimi','Amol','Amit','Shobha','Arnav','Abhi']),
       'Age':pd.Series([25,26,30,32,27,36,40]),
'Percentage':pd.Series([59.76,67.80,80,85,78.33,60,75])}

In [104]:
df = pd.DataFrame(data)
df

     Name  Age  Percentage
0    Anju   25       59.76
1    Rimi   26       67.80
2    Amol   30       80.00
3    Amit   32       85.00
4  Shobha   27       78.33
5   Arnav   36       60.00
6    Abhi   40       75.00

In [105]:
# Perform addition on each column

df.sum()

Name          AnjuRimiAmolAmitShobhaArnavAbhi
Age                                       216
Percentage                             505.89
dtype: object

In [106]:
# Perform addition on each column as axis = 1

df.sum(axis = 1)

0     84.76
1     93.80
2    110.00
3    117.00
4    105.33
5     96.00
6    115.00
dtype: float64

In [107]:
# Perform addition on a single column

df.Age.sum()

216

In [108]:
# It can be done as 

df['Age'].sum()

216

In [109]:
# Result with name of column

df[['Age']].sum()

Age    216
dtype: int64

In [110]:
# Adiition of two columns

df[['Age','Percentage']].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [111]:
# Perform sum on first two records of multiple columns

df.loc[:2,:][['Age','Percentage']].sum()

Age            81.00
Percentage    207.56
dtype: float64

In [112]:
df.drop(columns = 'Name').sum()

Age           216.00
Percentage    505.89
dtype: float64

In [113]:
df.iloc[:,1:].sum()

Age           216.00
Percentage    505.89
dtype: float64

In [114]:
df.sum()[['Age','Percentage']]

Age              216
Percentage    505.89
dtype: object

In [115]:
df.Age.sum(),df.Percentage.sum()

(216, 505.89)

In [116]:
# Get average of any column values

df.mean()

Age           30.857143
Percentage    72.270000
dtype: float64

In [117]:
# Mean of single column

df.mean()['Age']

30.857142857142858

In [118]:
# Comulative sum of single column

df.cumsum()['Age']

0     25
1     51
2     81
3    113
4    140
5    176
6    216
Name: Age, dtype: int64

In [119]:
# Get median of column

df.median()['Age']

30.0

In [120]:
# Get mode of column

df.mode()['Age']

0    25
1    26
2    27
3    30
4    32
5    36
6    40
Name: Age, dtype: int64

In [121]:
# Get standard deviation of column

df.std()['Age']

5.550632739564365

In [122]:
# Get minimum value of column

df.min()['Age']

25

##### Data summarization

In [123]:
# Check total records and columns, range of index, number of non null records in each column, data type of it and memory usage

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Age         7 non-null      int64
 2   Percentage  7 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes

In [124]:
# Get statistical analysis of data to see quartilewise data destribution

df.describe()

             Age  Percentage
count   7.000000    7.000000
mean   30.857143   72.270000
std     5.550633    9.941631
min    25.000000   59.760000
25%    26.500000   63.900000
50%    30.000000   75.000000
75%    34.000000   79.165000
max    40.000000   85.000000

In [125]:
# To see data horizontal

df.T

                0     1     2     3       4      5     6
Name         Anju  Rimi  Amol  Amit  Shobha  Arnav  Abhi
Age            25    26    30    32      27     36    40
Percentage  59.76  67.8  80.0  85.0   78.33   60.0  75.0

##### String data processing

In [126]:
# Create two series one of object data type and another of integer

s1=pd.Series(['Sanjay   ','###Abhijeet','Maha#& dev','*** Pallavi ***','Govind$#$','Roh   it','S #$upriya'])
print(s1)
s2 =pd.Series([25,26,32,34,25,75,14])
print(s2)

0          Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
dtype: object
0    25
1    26
2    32
3    34
4    25
5    75
6    14
dtype: int64

In [127]:
# Create DataFrame from series

d=pd.DataFrame({'Name':s1,'Age':s2})
d

              Name  Age
0        Sanjay      25
1      ###Abhijeet   26
2       Maha#& dev   32
3  *** Pallavi ***   34
4        Govind$#$   25
5         Roh   it   75
6       S #$upriya   14

First convert data frame to Series by specifying column name or index and then apply string methods on series.
String methods are not applicable on dataframe
If we want to access column with name 0(digit) we cant access it like s.0 instead we can access it as s[0]

In [128]:
# Remove special characters in each record

for i in d.loc[:,'Name']:
    print(''.join(char for char in i if char.isalnum()))

Sanjay
Abhijeet
Mahadev
Pallavi
Govind
Rohit
Supriya

In [129]:
# Boolean can be used as an indexing. It will return column whose boolean value is True

d.loc[:3,[True,False]]

              Name
0        Sanjay
1      ###Abhijeet
2       Maha#& dev
3  *** Pallavi ***

In [130]:
d.loc[[True,False,False,False,True,False,True],[True,False]]

         Name
0   Sanjay
4   Govind$#$
6  S #$upriya

In [131]:
# Det names ending with 't'. we first have to convert datframe to series. so that we can apply string methods

s3=d.loc[:,'Name']
s3

0          Sanjay
1        ###Abhijeet
2         Maha#& dev
3    *** Pallavi ***
4          Govind$#$
5           Roh   it
6         S #$upriya
Name: Name, dtype: object

In [132]:
s3[s3.str.endswith('t')]

1    ###Abhijeet
5       Roh   it
Name: Name, dtype: object

##### Deal with datatype of data frame

In [133]:
# Create DataFrame

df1 = pd.DataFrame([10,20,30,40])
df1

    0
0  10
1  20
2  30
3  40

In [134]:
# Check datatype of df

df1.dtypes

0    int64
dtype: object

index column has datatype integer while other column has object

In [135]:
# Explicite type casting while creation

df2 = pd.DataFrame([10,20,30,40],dtype='int32')
print(df2.dtypes)

0    int32
dtype: object

##### Explicite type casting after creation using astype

In [136]:
e = df2.astype('f2')    # float16
e

      0
0  10.0
1  20.0
2  30.0
3  40.0

In [137]:
e.dtypes

0    float16
dtype: object

In [138]:
# Use case

d=pd.DataFrame(['1','2','3'])
d

   0
0  1
1  2
2  3

In [139]:
d.dtypes

0    object
dtype: object

 As data is in string format

In [140]:
e = d.astype('int32')

In [141]:
e.dtypes

0    int32
dtype: object

##### Conditional selection of DataFrame

In [142]:
d = pd.DataFrame([35,12,14,5,8,18])
d

    0
0  35
1  12
2  14
3   5
4   8
5  18

In [143]:
d>10

       0
0   True
1   True
2   True
3  False
4  False
5   True

In [144]:
d[d>10]

      0
0  35.0
1  12.0
2  14.0
3   NaN
4   NaN
5  18.0

In [145]:
# Apply condition on series to avoid NaN

d[d[0]>10]

    0
0  35
1  12
2  14
5  18

##### Applying where clouse
It replace the values where the condition is false

In [146]:
# IF condition is False it replaces the value by NaN
# We an also write d.where(d[0]>10)

d.where(d>10)

      0
0  35.0
1  12.0
2  14.0
3   NaN
4   NaN
5  18.0

In [147]:
# If other is provided then it insert value of other to evry value which is not satisfying condition
# It can be writen as d.where(d>10,0)


d.where(d>10,other=0)

    0
0  35
1  12
2  14
3   0
4   0
5  18

In [148]:
# As it is 2D we have to specify axis for mean calculation
# It can be written as d.where(d[0]>10,d[0].mean())

d.where(d>10,d.mean(),axis=1)

           0
0  35.000000
1  12.000000
2  14.000000
3  15.333333
4  15.333333
5  18.000000

In [149]:
# It will substitute negative value at a place where condition becomes False

d.where(d[0]>10,-d)

    0
0  35
1  12
2  14
3  -5
4  -8
5  18

##### DataFrame creation using numpy

In [150]:
import numpy as np
d1 = pd.DataFrame(np.random.rand(4,4))
d1

          0         1         2         3
0  0.410131  0.273093  0.863476  0.975344
1  0.441255  0.507854  0.596638  0.123381
2  0.294538  0.260149  0.741075  0.249033
3  0.486236  0.207916  0.034606  0.359151

In [151]:
# Replace values by rowwise mean

d1.where(d1<0.5,d1.mean(),axis=0)

          0         1         2         3
0  0.410131  0.273093  0.408040  0.408040
1  0.441255  0.312253  0.312253  0.123381
2  0.294538  0.260149  0.558949  0.249033
3  0.486236  0.207916  0.034606  0.359151

In [152]:
q = pd.DataFrame(np.random.random((5,5)),columns=list('abcde'))
q

          a         b         c         d         e
0  0.005842  0.511171  0.121692  0.031404  0.371817
1  0.277402  0.498977  0.955321  0.937699  0.350643
2  0.131680  0.484421  0.113290  0.740650  0.105995
3  0.130137  0.142576  0.099744  0.651337  0.256893
4  0.083955  0.819993  0.186919  0.161211  0.019370

In [153]:
# Get first record of DataFrame

q[:1]

          a         b         c         d         e
0  0.005842  0.511171  0.121692  0.031404  0.371817

In [154]:
# Access one column as Series

q.d     
# q['d']   Also returns a series

0    0.031404
1    0.937699
2    0.740650
3    0.651337
4    0.161211
Name: d, dtype: float64

In [155]:
# Access one column as DataFrame

q[['d']]

          d
0  0.031404
1  0.937699
2  0.740650
3  0.651337
4  0.161211

In [156]:
# Wherever condition is false it insert NaN there

q['d'].where(q['d']>0.3)

0         NaN
1    0.937699
2    0.740650
3    0.651337
4         NaN
Name: d, dtype: float64

##### Mask- It is exactly aposite of where. It will substitute value if condition is true otherwise keep as it is.

In [157]:
q['d'].mask(q['d']>0.3)     # Output is in yhe format of series

0    0.031404
1         NaN
2         NaN
3         NaN
4    0.161211
Name: d, dtype: float64

Here, wherever condition is true insert NaN there and output is in the series format

In [158]:
# Get output in DataFrame format

q[['d']].mask(q['d']>0.3)

          d
0  0.031404
1       NaN
2       NaN
3       NaN
4  0.161211

In [159]:
# Wherever condition is true put negative value else ignore it.

q[['d']].mask(q['d']>0.3,-q[['d']])

          d
0  0.031404
1 -0.937699
2 -0.740650
3 -0.651337
4  0.161211

##### Query: It wikk execute some expression on DataFrame

In [160]:
# Create DataFrame

import pandas as pd
df = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C': range(10, 15)})
df

   A   B   C
0  1  10  10
1  2   8  11
2  3   6  12
3  4   4  13
4  5   2  14

In [161]:
# Get records where value of column A is greater than value of column B

df.query('A>B')

   A  B   C
4  5  2  14

In [162]:
# Get Records of column B for which value of column A is 3

df[df['A']==3 ]['B']

2    6
Name: B, dtype: int64

In [163]:
#It can be executed as

df.query('A==3').B

2    6
Name: B, dtype: int64

In [164]:
# Get Records of column A&B for which value of column A is 3

df.query('A==3')[['A','B']]

   A  B
2  3  6

In [165]:
# It can be like without query

df[df['A']==3][['A','B']]

   A  B
2  3  6

In [166]:
# Get series as a addition of values from column A&B

df['A']+df['B']

0    11
1    10
2     9
3     8
4     7
dtype: int64

In [167]:
# Get output in the form of array
df.eval(df.A+df.B)

array([11, 10, 9, 8, 7], dtype=object)

In [168]:
# Output in the form of series

df.eval('A+C')

0    11
1    13
2    15
3    17
4    19
dtype: int64